Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.settings.itermaddtriggerviewcontroller.cpu_time.5119267e
source: CPU Time:
zh_hans: CPU 时间：

# ui.settings.itermaddtriggerviewcontroller.enabled.92c1cdfd
source: Enabled
zh_hans: 已启用

source: Hide content regex visualization
zh_hans: 隐藏内容正则表达式可视化

# ui.settings.itermaddtriggerviewcontroller.hide_visualization.7405ee33
source: Hide visualization
zh_hans: 隐藏可视化

# ui.settings.itermaddtriggerviewcontroller.instant.e2861894
source: Instant
zh_hans: 即时

# ui.settings.itermaddtriggerviewcontroller.job.34b0e24b
source: Job:
zh_hans: 作业：

# ui.settings.itermaddtriggerviewcontroller.match_against.0ba1fe07
source: Match Against:
zh_hans: 匹配对象：

# ui.settings.itermaddtriggerviewcontroller.name.2683cad4
source: Name:
zh_hans: 名称：

# ui.settings.itermaddtriggerviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.itermaddtriggerviewcontroller.only_on_the_workgroup_leader.85f3c87d
source: Only on the workgroup leader
zh_hans: 仅限工作组主会话

# ui.settings.itermaddtriggerviewcontroller.page_content.fce9c5d4
source: Page Content
zh_hans: 页面内容

# ui.settings.itermaddtriggerviewcontroller.parameters.03acaf78
source: Parameters:
zh_hans: 参数：

# ui.settings.itermaddtriggerviewcontroller.regular_expression.2aa42833
source: Regular Expression
zh_hans: 正则表达式

# ui.settings.itermaddtriggerviewcontroller.regular_expression.8182fd85
source: Regular Expression:
zh_hans: 正则表达式：

# ui.settings.itermaddtriggerviewcontroller.set_job_above.eafff9d1
source: Set job above
zh_hans: 设置上方的作业

source: Show content regex visualization
zh_hans: 显示内容正则表达式可视化

# ui.settings.itermaddtriggerviewcontroller.show_visualization.f1168681
source: Show visualization
zh_hans: 显示可视化

source: Trigger enabled only for this job (e.g., emacs)
zh_hans: 仅对此作业启用触发器（例如 emacs）

# ui.settings.itermaddtriggerviewcontroller.update_profile.6c33ed13
source: Update Profile
zh_hans: 更新配置文件

# ui.settings.itermaddtriggerviewcontroller.url_regex.5d966436
source: URL Regex:
zh_hans: URL 正则表达式：

source: When set, the trigger fires only for the workgroup leader (the session that originally entered the workgroup). Peers such as the Code Review and Diff sessions do not, so reloading or quitting one keeps the workgroup open.
zh_hans: 启用后，触发器仅在工作组主会话（最初进入工作组的会话）中触发。代码审查和差异等对等会话不会触发，因此重新加载或退出其中一个会话不会关闭工作组。

# ui.settings.itermadvancedsettingsviewcontroller.no.1ea442a1
source: No
zh_hans: 否

# ui.settings.itermadvancedsettingsviewcontroller.unspecified.5b8aa0bf
source: Unspecified
zh_hans: 未指定

# ui.settings.itermadvancedsettingsviewcontroller.yes.85a39ab3
source: Yes
zh_hans: 是

# ui.settings.itermcolorpresets.add_duplicate_color_preset.4fdefd2b
source: Add duplicate color preset?
zh_hans: 要添加重复的配色方案吗？

# ui.settings.itermcolorpresets.add_it_anyway.46e98368
source: Add it anyway
zh_hans: 仍要添加

# ui.settings.itermcolorpresets.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.itermcolorpresets.import_failed.a9da6cb3
source: Import Failed.
zh_hans: 导入失败。

# ui.settings.itermcolorpresets.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.itermcolorpresets.the_color_preset_is_the_same_as_the.7b2e6f35
source: The color preset “%@” is the same as the preset you're trying to add. Really add it?
zh_hans: 配色预设“%@”与您要添加的预设相同。仍要添加吗？

# ui.settings.itermcolorpresets.the_selected_file_could_not_be_read_or.b44c56dd
source: The selected file could not be read or did not contain a valid color scheme.
zh_hans: 无法读取所选文件，或文件中不包含有效的配色方案。

# ui.settings.itermeditkeyactionwindowcontroller.apply_to_all_sessions.4fc28dad
source: Apply to all sessions
zh_hans: 应用到所有会话

source: Apply to all sessions except current
zh_hans: 应用到当前会话以外的所有会话

source: Apply to all sessions in tab
zh_hans: 应用到标签页中的所有会话

source: Apply to all sessions in window
zh_hans: 应用到窗口中的所有会话

source: Apply to broadcasted-to sessions
zh_hans: 应用到接收广播输入的会话

# ui.settings.itermeditkeyactionwindowcontroller.apply_to_current_session.a4599bb4
source: Apply to current session
zh_hans: 应用到当前会话

# ui.settings.itermeditkeyactionwindowcontroller.keyboard_shortcut.922b8703
source: Keyboard Shortcut:
zh_hans: 键盘快捷键：

source: Label to show in Touch Bar
zh_hans: 在 Touch Bar 中显示的标签

# ui.settings.itermeditkeyactionwindowcontroller.title.7e8cd205
source: Title
zh_hans: 标题

source: Title (Interpolated String)
zh_hans: 标题（插值字符串）

# ui.settings.itermeditkeyactionwindowcontroller.touch_bar_label.ec9d8d97
source: Touch Bar Label
zh_hans: Touch Bar 标签

source: C-Style Backslash Escaping supports: \a (bell), \b (backspace), \e (escape), \n (newline), \r (carriage return), \t (tab), \\ (backslash), and \x followed by two hex digits giving a single byte of UTF-8. Unescaped Literal Text does not have any special characters. Backward Compatibility Escaping, which is not recommended for new snippets, supports: \n (newline), \e (escape), \a (bell), and \t (tab).
zh_hans: C 风格反斜杠转义支持：\a（响铃）、\b（退格）、\e（Escape）、\n（换行）、\r（回车）、\t（制表符）、\\（反斜杠），以及后跟两个十六进制数字的 \x（表示一个 UTF-8 字节）。 未转义的字面文本不包含任何特殊字符。 不建议用于新片段的向后兼容转义支持：\n（换行）、\e（Escape）、\a（响铃）和 \t（制表符）。

# ui.settings.itermeditsnippetwindowcontroller.escaping.436b2c35
source: Escaping
zh_hans: 转义

# ui.settings.itermeditsnippetwindowcontroller.untitled.f59ab8d1
source: Untitled
zh_hans: 未命名

# ui.settings.itermkeymappingviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.itermkeymappingviewcontroller.export.4a4c59c5
source: Export…
zh_hans: 导出…

# ui.settings.itermkeymappingviewcontroller.import.ea94509e
source: Import…
zh_hans: 导入…

# ui.settings.itermkeymappingviewcontroller.keep.183f00f4
source: Keep
zh_hans: 保留

# ui.settings.itermkeymappingviewcontroller.load_preset.1a121983
source: Load Preset
zh_hans: 加载预设

# ui.settings.itermkeymappingviewcontroller.remove.c3812fc4
source: Remove
zh_hans: 移除

source: Remove all key mappings before %@?
zh_hans: 在%@前移除所有按键映射吗？

# ui.settings.itermpreferences.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.itermpreferences.load_gitlab_settings.6137122c
source: Load Gitlab Settings
zh_hans: 加载 GitLab 设置

source: Load settings from Gitlab settings-like URL on pasteboard?
zh_hans: 要从剪贴板上的 GitLab 设置类 URL 加载设置吗？

# ui.settings.itermpreferences.ok.565339bc
source: OK
zh_hans: 好

source: A required file appears to be missing or corrupted and iTerm2’s code signature could not be verified. You should download a fresh copy of the app and reinstall it.
zh_hans: 所需文件似乎缺失或损坏，无法验证 iTerm2 的代码签名。请重新下载并安装应用。

source: A required file appears to be missing or corrupted, yet against all odds the code signature for iTerm2 is valid. Please file a bug at https://iterm2.com/bugs
zh_hans: 所需文件似乎缺失或损坏，但 iTerm2 的代码签名仍然有效。请前往 https://iterm2.com/bugs 报告 Bug

source: A required file appears to be missing or corrupted and iTerm2’s code signature did not match that of the official distribution. You should download a fresh copy of the app and reinstall it.
zh_hans: 所需文件似乎缺失或损坏，且 iTerm2 的代码签名与官方发行版不匹配。请重新下载并安装应用。

# ui.settings.itermpreferencesbaseviewcontroller.application_corrupt.c446cbb1
source: Application Corrupt
zh_hans: 应用已损坏

# ui.settings.itermpreferencesbaseviewcontroller.ok.565339bc
source: OK
zh_hans: 好

source: While trying to load the setting for “%@”: %@
zh_hans: 尝试加载“%@”设置时：%@

# ui.settings.itermremotepreferences.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.itermremotepreferences.copy.e21f935f
source: Copy
zh_hans: 拷贝

# ui.settings.itermremotepreferences.copy_data_files
source: Your snippets, notes, or icon customizations changed. Copy them to %@?
zh_hans: 片段、备注或图标自定义项已有更改。要将它们复制到 %@ 吗？

# ui.settings.itermremotepreferences.copy_settings
source: Settings have changed. Copy them to %@?
zh_hans: 设置已有更改。要将其复制到 %@ 吗？

# ui.settings.itermremotepreferences.copy_settings_and_data_files
source: Settings and your snippets, notes, or icon customizations have changed. Copy them to %@?
zh_hans: 设置以及片段、备注或图标自定义项已有更改。要将它们复制到 %@ 吗？

# ui.settings.itermremotepreferences.disable_loading_from_url.e9f2d225
source: Disable Loading from URL
zh_hans: 停用从 URL 加载

# ui.settings.itermremotepreferences.discard_local_changes.43a52a6a
source: Discard Local Changes
zh_hans: 放弃本地更改

# ui.settings.itermremotepreferences.don_t_load_remote_settings.434f226e
source: Don’t Load Remote Settings
zh_hans: 不加载远程设置

# ui.settings.itermremotepreferences.error_loading_settings.282106c8
source: Error Loading Settings
zh_hans: 加载设置时出错

source: Failed to copy settings to custom directory.
zh_hans: 无法将设置复制到自定义目录。

source: Failed to load settings from custom directory. Falling back to local copy.
zh_hans: 无法从自定义目录加载设置，将改用本地副本。

source: Failed to load settings from URL. Falling back to local copy.
zh_hans: 无法从 URL 加载设置，将改用本地副本。

# ui.settings.itermremotepreferences.http_request_failed.039fef04
source: HTTP request failed: %@
zh_hans: HTTP 请求失败：%@

source: iTerm2 can also keep your snippets, global notes, and session icon customizations in the settings folder “%@” so they sync across machines. Notes and snippets can contain sensitive text such as passwords or tokens. Sync them too?
zh_hans: iTerm2 还可以将您的片段、全局笔记和会话图标自定义内容保存在设置文件夹“%@”中，以便在多台设备之间同步。笔记和片段可能包含密码或令牌等敏感文本。也同步这些内容吗？

# ui.settings.itermremotepreferences.just_settings.1b3cfdce
source: Just Settings
zh_hans: 仅同步设置

# ui.settings.itermremotepreferences.keep_local_changes.74aeac4f
source: Keep Local Changes
zh_hans: 保留本地更改

source: Load settings from URL? Some changes were made to the local copy that will be lost.
zh_hans: 要从 URL 加载设置吗？本地副本中的某些更改将丢失。

# ui.settings.itermremotepreferences.lose_changes.26b6bf11
source: Lose Changes
zh_hans: 放弃更改

# ui.settings.itermremotepreferences.missing_or_malformed_file_at.a591d4b5
source: Missing or malformed file at "%@"
zh_hans: “%@”处的文件缺失或格式不正确

# ui.settings.itermremotepreferences.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.itermremotepreferences.overwrite.b24963ea
source: Overwrite
zh_hans: 覆盖

# ui.settings.itermremotepreferences.reveal_in_settings.21379104
source: Reveal in Settings
zh_hans: 在设置中显示

source: Settings at %@ changed since iTerm2 started. Overwrite it?
zh_hans: iTerm2 启动后，%@ 中的设置已发生更改。要覆盖吗？

# ui.settings.itermremotepreferences.settings_cannot_be_copied_to_a_url.9c603a79
source: Settings cannot be copied to a URL.
zh_hans: 无法将设置复制到 URL。

source: Snippets, notes, or icon customizations changed both on this Mac and in the settings folder “%@” since they were last in sync. Which copy would you like to keep?
zh_hans: 自上次同步以来，片段、笔记或图标自定义内容在此 Mac 和设置文件夹“%@”中都发生了更改。您要保留哪个副本？

# ui.settings.itermremotepreferences.sync_these_too.4c843d50
source: Sync These Too
zh_hans: 同时同步这些内容

source: To make it available, first quit iTerm2 and then manually copy %@ to your hosting provider.
zh_hans: 要使其可用，请先退出 iTerm2，然后手动将 %@ 复制到托管位置。

# ui.settings.itermremotepreferences.tried_to_copy_to.de48b2b6
source: Tried to copy %@ to %@
zh_hans: 尝试将 %@ 复制到 %@

# ui.settings.itermremotepreferences.try_again_without_timeout.31f258de
source: Try Again Without Timeout
zh_hans: 重试且不设超时

# ui.settings.itermremotepreferences.use_settings_folder_s.8aae0142
source: Use Settings Folder’s
zh_hans: 使用设置文件夹中的版本

# ui.settings.itermremotepreferences.use_this_mac_s.d1664952
source: Use This Mac’s
zh_hans: 使用此 Mac 上的版本

source: You have enabled “Load settings from a custom folder or URL” in settings but the location is not set.
zh_hans: 已在设置中启用“从自定义文件夹或 URL 加载设置”，但尚未设置位置。

# ui.settings.itermsemantichistoryprefscontroller.enter_command.c3793610
source: Enter command
zh_hans: 输入命令

# ui.settings.itermsemantichistoryprefscontroller.enter_text.3bcca28c
source: Enter text
zh_hans: 输入文本

# ui.settings.itermsemantichistoryprefscontroller.enter_url.de285e29
source: Enter URL.
zh_hans: 输入 URL。

# ui.settings.itermsemantichistoryprefscontroller.help.any_click
source: In this mode semantic history will be activated on any click, even if you click on something that is not an existing file.
zh_hans: 在此模式下，点击任何内容都会启用语义历史，即使点击的内容不是现有文件。

# ui.settings.itermsemantichistoryprefscontroller.help.command_file
source: Command runs when you activate Semantic History on any filename. Use \1 for filename, \2 for line number, \3 for text before click, \4 for text after click, \5 for pwd. You can also use interpolated string syntax.
zh_hans: 对任意文件名启用语义历史时，将运行命令。 使用 \1 表示文件名、\2 表示行号、\3 表示点击位置之前的文本、\4 表示点击位置之后的文本、\5 表示工作目录。 也可以使用插值字符串语法。

# ui.settings.itermsemantichistoryprefscontroller.help.command_text
source: Command runs when you activate Semantic History on any text, even if it’s not a valid filename. Use \1 for filename, \2 for line number, \3 for text before click, \4 for text after click, \5 for pwd.
zh_hans: 对任意文本启用语义历史时，将运行命令，即使该文本不是有效的文件名。 使用 \1 表示文件名、\2 表示行号、\3 表示点击位置之前的文本、\4 表示点击位置之后的文本、\5 表示工作目录。

# ui.settings.itermsemantichistoryprefscontroller.help.coprocess
source: Coprocess runs when you activate Semantic History on any filename. Use \1 for filename, \2 for line number, \3 for text before click, \4 for text after click, \5 for pwd.
zh_hans: 对任意文件名启用语义历史时，将运行协进程。 使用 \1 表示文件名、\2 表示行号、\3 表示点击位置之前的文本、\4 表示点击位置之后的文本、\5 表示工作目录。

# ui.settings.itermsemantichistoryprefscontroller.help.existing_file
source: In this mode semantic history will only be activated when you click on an existing file name.
zh_hans: 在此模式下，只有点击现有文件名时才会启用语义历史。

# ui.settings.itermsemantichistoryprefscontroller.help.learn_more
source: Learn more
zh_hans: 了解更多

# ui.settings.itermsemantichistoryprefscontroller.help.send_text
source: Text is sent when you activate Semantic History on any filename. Use vim-style special characters.Use \1 for filename, \2 for line number, \3 for text before click, \4 for text after click, \5 for pwd.
zh_hans: 对任意文件名启用语义历史时，将发送文本。请使用 vim 风格的特殊字符。使用 \1 表示文件名、\2 表示行号、\3 表示点击位置之前的文本、\4 表示点击位置之后的文本、\5 表示工作目录。

# ui.settings.itermsemantichistoryprefscontroller.help.substitutions
source: You can provide substitutions as follows: \1 will be replaced with the filename. \2 will be replaced with the line number. \3 will be replaced with the text before the click. \4 will be replaced with the text after the click. \5 will be replaced with the working directory. This is also an interpolated string evaluated in the context of the current session. In addition to the usual variables, the following substitutions are available: \(semanticHistory.path) will be replaced with the filename. \(semanticHistory.lineNumber) will be replaced with the line number. \(semanticHistory.columnNumber) will be replaced with the column number. \(semanticHistory.prefix) will be replaced with the text before the click. \(semanticHistory.suffix) will be replaced with the text after the click. \(semanticHistory.workingDirectory) will be replaced with the working directory.
zh_hans: 可以使用以下替换参数： \1 将替换为文件名。 \2 将替换为行号。 \3 将替换为点击位置之前的文本。 \4 将替换为点击位置之后的文本。 \5 将替换为工作目录。 这也是一个在当前会话上下文中求值的插值字符串。除常规变量外，还可使用以下替换参数： \(semanticHistory.path) 将替换为文件名。 \(semanticHistory.lineNumber) 将替换为行号。 \(semanticHistory.columnNumber) 将替换为列号。 \(semanticHistory.prefix) 将替换为点击位置之前的文本。 \(semanticHistory.suffix) 将替换为点击位置之后的文本。 \(semanticHistory.workingDirectory) 将替换为工作目录。

# ui.settings.itermsemantichistoryprefscontroller.help.url
source: When you activate Semantic History on a filename, the browser opens a URL. Use \1 for the filename you clicked on and \2 for the line number.
zh_hans: 对文件名启用语义历史时，浏览器会打开一个 URL。 使用 \1 表示点击的文件名，\2 表示行号。

source: When you activate Semantic History on a filename, the associated app loads the file.
zh_hans: 对文件名启用语义历史时，关联的应用会加载该文件。

source: When you activate Semantic History on a text file, the specified editor opens it. Other kinds of files will be opened with their default apps.
zh_hans: 对文本文件启用语义历史时，将使用指定的编辑器打开它。 其他类型的文件将使用其默认应用打开。

# ui.settings.itermsnippetseditingviewcontroller.add_above.2216cae2
source: Add Above
zh_hans: 在上方添加

# ui.settings.itermsnippetseditingviewcontroller.add_below.da0bb1ba
source: Add Below
zh_hans: 在下方添加

# ui.settings.itermsnippetseditingviewcontroller.delete.e2d0a549
source: Delete
zh_hans: 删除

# ui.settings.itermsnippetseditingviewcontroller.duplicate.02cdaabf
source: Duplicate
zh_hans: 复制

# ui.settings.itermsnippetseditingviewcontroller.edit.464c4ffd
source: Edit
zh_hans: 编辑

# ui.settings.itermsnippetseditingviewcontroller.error_saving_to.9c1965ed
source: Error saving to %@: %@
zh_hans: 保存到 %@ 时出错：%@

# ui.settings.itermsnippetseditingviewcontroller.export_failed.9a5e4d95
source: Export Failed
zh_hans: 导出失败

# ui.settings.itermsnippetseditingviewcontroller.import_failed.09876dab
source: Import Failed
zh_hans: 导入失败

# ui.settings.itermsnippetseditingviewcontroller.malformed_file_at.7dee9e42
source: Malformed file at %@
zh_hans: %@ 处的文件格式不正确

# ui.settings.itermsnippetseditingviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.itermsnippetseditingviewcontroller.while_loading.6d2b4144
source: While loading %@: %@
zh_hans: 加载 %@ 时出错：%@

# ui.settings.itermsnippetseditingviewcontroller.while_parsing.e18bb6fb
source: While parsing %@: %@
zh_hans: 解析 %@ 时出错：%@

# ui.settings.key_mapping_repair.message.plural
source: This will repair %1$lld key bindings that were corrupted by a bug in an earlier version of iTerm2. The affected bindings currently display incorrectly but function properly. After repair, they will display correctly. Affected key bindings: %2$@
zh_hans: 即将修复由旧版 iTerm2 中的缺陷损坏的 %1$lld 个按键绑定。受影响的按键绑定目前显示不正确，但功能正常。修复后将正确显示。 受影响的按键绑定： %2$@

# ui.settings.key_mapping_repair.message.singular
source: This will repair %1$lld key binding that was corrupted by a bug in an earlier version of iTerm2. The affected binding currently displays incorrectly but functions properly. After repair, it will display correctly. Affected key binding: %2$@
zh_hans: 即将修复由旧版 iTerm2 中的缺陷损坏的 %1$lld 个按键绑定。受影响的按键绑定目前显示不正确，但功能正常。修复后将正确显示。 受影响的按键绑定： %2$@

source: A new profile called “%@” was created for you. It is tuned to work well for the Hotkey Window feature and it can be customized in the Profiles tab.
zh_hans: 已为您创建名为“%@”的新配置文件。它已针对热键窗口功能进行优化，您可以在“配置文件”标签页中自定义。

source: Add Another Hotkey Window Profile?
zh_hans: 要再添加一个热键窗口配置文件吗？

# ui.settings.keyspreferencesviewcontroller.as_a_hotkey.44b9579e
source: as a hotkey
zh_hans: 用作热键

# ui.settings.keyspreferencesviewcontroller.as_the_leader.f44e2814
source: as the leader
zh_hans: 用作前导键

# ui.settings.keyspreferencesviewcontroller.as_the_open_quickly_hotkey.ad5bfc40
source: as the Open Quickly hotkey
zh_hans: 用作“快速打开”热键

# ui.settings.keyspreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.keyspreferencesviewcontroller.configure_existing_profile.e0e4f694
source: Configure Existing Profile
zh_hans: 配置现有配置文件

# ui.settings.keyspreferencesviewcontroller.emulate_us_keyboard.3a1c6328
source: Emulate US Keyboard
zh_hans: 模拟美式键盘

source: Hotkey Window Successfully Configured
zh_hans: 热键窗口已成功配置

# ui.settings.keyspreferencesviewcontroller.keep.183f00f4
source: Keep
zh_hans: 保留

# ui.settings.keyspreferencesviewcontroller.load_preset.1a121983
source: Load Preset
zh_hans: 加载预设

# ui.settings.keyspreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.keyspreferencesviewcontroller.remove.c3812fc4
source: Remove
zh_hans: 移除

source: Remove all key mappings before loading %@?
zh_hans: 加载 %@ 前移除所有按键映射吗？

source: Some keyboard layouts (such as AZERTY) require a modifier to press a number key. This causes problems for switching to a window, tab, or split pane by pressing modifier+number: you might need other modifiers or conflicting modifiers. When “Emulate US Keyboard” is enabled, you can press the configured modifier plus the key on the top row that corresponds to a number key on a US keyboard. For example, on AZERTY, the & key would act as the 1 key.
zh_hans: 某些键盘布局（例如 AZERTY）需要配合修饰键才能输入数字。这会影响用修饰键+数字切换窗口、标签页或分割窗格：可能需要额外或冲突的修饰键。启用“模拟美式键盘”后，可以按已配置的修饰键和顶行中对应美式键盘数字键的按键。例如在 AZERTY 键盘上，& 键将作为 1 键。

source: The global keyboard shortcut you have set is overridden by at least one profile. Check your profiles’ keyboard settings if it doesn't work as expected.
zh_hans: 你设置的全局键盘快捷键已被至少一个配置文件覆盖。如果快捷键未按预期工作，请检查配置文件的键盘设置。

# ui.settings.keyspreferencesviewcontroller.touch_bar_item_added_notification_body
source: Select View > Customize Touch Bar to enable your new touch bar item.
zh_hans: 选择“显示”>“自定 Touch Bar”，以启用新的 Touch Bar 项目。

source: Touch Bar Item Added
zh_hans: 已添加 Touch Bar 项目

# ui.settings.pointerprefscontroller.characters_to_send.a988c1eb
source: characters to send
zh_hans: 要发送的字符

# ui.settings.pointerprefscontroller.enter_function_invocation.9ca13521
source: Enter function invocation
zh_hans: 输入函数调用

# ui.settings.pointerprefscontroller.enter_value_to_send.2ed37f5b
source: Enter value to send
zh_hans: 输入要发送的值

# ui.settings.pointerprefscontroller.ex_0x7f_0x20.e68fba4e
source: ex: 0x7f 0x20
zh_hans: 例如：0x7f 0x20

# ui.settings.pointerprefscontroller.hex_codes.2504b906
source: Hex codes:
zh_hans: 十六进制代码：

# ui.settings.pointerprefscontroller.profile.468998b1
source: Profile:
zh_hans: 配置文件：

# ui.settings.pointerprefscontroller.text.796961b8
source: Text:
zh_hans: 文本：

# ui.settings.pointerprefscontroller.unknown.57ac0a07
source: (Unknown)
zh_hans: （未知）

# ui.settings.preferencepanel.advanced.9f088dbe
source: Advanced
zh_hans: 高级

# ui.settings.preferencepanel.appearance.3907fa7f
source: Appearance
zh_hans: 外观

# ui.settings.preferencepanel.arrangements.d79df164
source: Arrangements
zh_hans: 窗口布局

# ui.settings.preferencepanel.edit_session.5ccc6055
source: Edit Session
zh_hans: 编辑会话

# ui.settings.preferencepanel.general.c910d474
source: General
zh_hans: 通用

# ui.settings.preferencepanel.keys.f0d66a79
source: Keys
zh_hans: 按键

# ui.settings.preferencepanel.pointer.d00f1e4d
source: Pointer
zh_hans: 指针

# ui.settings.preferencepanel.profiles.535e52e4
source: Profiles
zh_hans: 配置文件

# ui.settings.preferencepanel.reset_to.acb6fc58
source: Reset to %@
zh_hans: 还原为 %@

# ui.settings.preferencepanel.search_options.c7c2c69c
source: Search Options
zh_hans: 搜索选项

# ui.settings.preferencepanel.settings.470af944
source: Settings: %@
zh_hans: 设置：%@

# ui.settings.preferencepanel.settings.74a883a0
source: Settings
zh_hans: 设置

# ui.settings.preferencepanel.shortcuts.46e978d0
source: Shortcuts
zh_hans: 快捷键

# ui.settings.preferencepanel.show_indicators_for_non_default_values.e91c044e
source: Show indicators for non-default values
zh_hans: 显示非默认值指示符

source: A required user interface component is missing or corrupted and iTerm2’s code signature could not be verified. You should download a fresh copy of the app and reinstall it.
zh_hans: 缺少必要的用户界面组件或该组件已损坏，并且无法验证 iTerm2 的代码签名。请重新下载应用并安装。

source: A required user interface component is missing or corrupted and iTerm2’s code signature did not match that of the official distribution. You should download a fresh copy of the app and reinstall it.
zh_hans: 所需的用户界面组件缺失或损坏，且 iTerm2 的代码签名与官方发行版不匹配。请下载全新副本并重新安装。

source: A required user interface component is missing or corrupted, yet against all odds the code signature for iTerm2 is valid. Please file a bug at https://iterm2.com/bugs
zh_hans: 所需的用户界面组件缺失或损坏，但 iTerm2 的代码签名仍然有效。请前往 https://iterm2.com/bugs 提交错误报告。

# ui.settings.profilepreferencesviewcontroller.abort.7a3a94a8
source: Abort
zh_hans: 中止

# ui.settings.profilepreferencesviewcontroller.application_corrupt.c446cbb1
source: Application Corrupt
zh_hans: 应用已损坏

# ui.settings.profilepreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.profilepreferencesviewcontroller.changes_will_be_lost.41d8a997
source: Changes Will Be Lost
zh_hans: 更改将丢失

# ui.settings.profilepreferencesviewcontroller.could_not_import_profile.bddd7cab
source: Could not Import Profile
zh_hans: 无法导入配置文件

source: Couldn't convert one or more profiles to JSON. Check Console.app for errors.
zh_hans: 无法将一个或多个配置文件转换为 JSON。请在 Console.app 中查看错误。

source: Couldn't convert profile to JSON: %@
zh_hans: 无法将配置文件转换为 JSON：%@

# ui.settings.profilepreferencesviewcontroller.couldn_t_save_to_on.e495ad91
source: Couldn't save to “%@” on %@: %@
zh_hans: 无法将内容保存到 %@ 上的“%@”：%@
